Overload List
Name  |   Description
GetLocalCoordinateSystem
 Gets the local coordinate system (LCS) for an analytical model element.
 (Inherited from  AnalyticalModel  .)
GetLocalCoordinateSystem(Double)
 Gets the local coordinate system (LCS) reflects analytical model orientation at the specified parameter value along a curve.
 (Inherited from  AnalyticalModelStick  .)
GetLocalCoordinateSystem(XYZ)
 Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
 (Inherited from  AnalyticalModelStick  .)
 See Also
  AnalyticalModelColumn Class
  AnalyticalModelColumn Members
  Autodesk.Revit.DB.Structure Namespace